CFDEM/CFDEMcoupling/tutorials/ETFBCfdemSolverRhoPimple /JouleHeatFluidizedBed/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("libcatchyFiniteVolume.so");

application     cfdemSolverRhoPimple;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.0002;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  5;

writeCompression compressed;

timeFormat      general;

timePrecision   7;

runTimeModifiable yes;

maxCo		0.6;

functions
{
        fieldAverage1
    {
        type            fieldAverage;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  off;
                base        time;
                window	  2.0;
            }
	    Us
            {
                mean        on;
                prime2Mean  off;
                base        time;
                window	  2.0;
            }
	    voidfraction
            {
                mean        on;
                prime2Mean  off;
                base        time;
                window	  2.0;
            }
	    rho
            {
                mean        on;
                prime2Mean  off;
                base        time;
                window	  2.0;
            }
            p
            {
                mean        on;
                prime2Mean  off;
                base        time;
                window	  2.0;
            }
	    phi
            {
                mean        on;
                prime2Mean  off;
                base        time;
                window	  2.0;
            }
	    NuField
            {
                mean        on;
                prime2Mean  off;
                base        time;
                window	  2.0;
            }
	    T
	    {
		mean        on;
                prime2Mean  off;
                base        time;
                window	  2.0;
	    }
        );
	}
}

OptimisationSwitches
{
	fileHandler	collated;
}
// ************************************************************************* //
