CFDEM/CFDEMcoupling/tutorials/ETFBCfdemSolverRhoPimple /JouleHeatFluidizedBed/CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          51;
        startFace       9593;
    }
    outlet
    {
        type            patch;
        nFaces          78;
        startFace       9644;
    }
    electrode_center
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          237;
        startFace       9722;
    }
    electrode_sidewall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          162;
        startFace       9959;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          384;
        startFace       10121;
    }
    front
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1172;
        startFace       10505;
    }
    back
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1173;
        startFace       11677;
    }
)

// ************************************************************************* //
