CFDEM/CFDEMcoupling/tutorials/ETFBCfdemSolverRhoPimple /JouleHeatFluidizedBed/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
	value 		uniform (0 0 0.1051); //inlet velocity 250um:0.044 - 500um:0.16 -  1000um:0.48
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    walls
    {
        type            fixedValue;
        value		uniform (0 0 0);
    }
    electrode_center
    {
        type            fixedValue;
        value		uniform (0 0 0);
    }
    
    electrode_sidewall
    {
        type            fixedValue;
        value		uniform (0 0 0);
    }

    back
    {
        type            fixedValue;
        value		uniform (0 0 0);
    }
    front
    {
        type            fixedValue;
        value		uniform (0 0 0);
    }
}

// ************************************************************************* //

