CFDEM/CFDEMcoupling/tutorials/ETFBCfdemSolverRhoPimple /JouleHeatFluidizedBed/CFD/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
    }

    outlet
    {
        type            totalPressure;
        p0              $internalField;
        value           $internalField;
    }
    walls
    {
        type            fixedFluxPressure;
    }
    electrode_center
    {
        type            fixedFluxPressure;
    }    
    electrode_sidewall
    {
        type            fixedFluxPressure;
    }    
    back
    {
        type            fixedFluxPressure;
    }
    front
    {
        type            fixedFluxPressure;
    }
}

// ************************************************************************* //
