CFDEM/CFDEMcoupling/tutorials/ETFBCfdemSolverRhoPimple /JouleHeatFluidizedBed/CFD/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.001;
        value           $internalField;
    }

    outlet
    {
        type               zeroGradient;
    }

    walls
    {
        type               epsilonWallFunction;
        value              $internalField;
    }
    
    electrode_center
    {
        type               epsilonWallFunction;
        value              $internalField;
    }
    
    electrode_sidewall
    {
        type               epsilonWallFunction;
        value              $internalField;
    }

    front
    {
        type               epsilonWallFunction;
        value              $internalField;
    }

    back
    {
        type               epsilonWallFunction;
        value              $internalField;
    }
}


// ************************************************************************* //
