CFDEM/CFDEMcoupling/tutorials/ETFBCfdemSolverRhoPimple /JouleHeatFluidizedBed/CFD/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 2 -1 0 0 0 0];

internalField       uniform 0;

boundaryField
{
    inlet
    {
        type               calculated;
        value              $internalField;
    }

    outlet
    {
        type               calculated;
        value              $internalField;
    }

    walls
    {
        type               nutkWallFunction;
	Prt		   0.85;
        value              $internalField;
    }
    
    electrode_center
    {
        type               nutkWallFunction;
	Prt		   0.85;
        value              $internalField;
    }

    electrode_sidewall
    {
        type               nutkWallFunction;
	Prt		   0.85;
        value              $internalField;
    }

    back
    {
        type               nutkWallFunction;
	Prt		   0.85;
        value              $internalField;
    }

    front
    {
        type               nutkWallFunction;
	Prt		   0.85;
        value              $internalField;
    }

}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
