CFDEM/CFDEMcoupling/tutorials/ETFBCfdemSolverRhoPimple /JouleHeatFluidizedBed/CFD/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

d2dt2Schemes
{
    default         Euler;
}


gradSchemes
{
    default         Gauss linear; //leastSquares;
}

divSchemes
{
    default        	Gauss linear;
    
    div(phi,U)      	Gauss limitedLinearV 1;
    div(phi,omega)	Gauss limitedLinear 1;
    div(phi,k)		Gauss limitedLinear 1;
    div(phi,K)		Gauss limitedLinear 1;
    div(phi,h)		Gauss limitedLinear 1;
    
    div((nuEff*dev2(T(grad(U)))))	Gauss linear;
    div(((nu*rho)*dev(grad(U).T())))	Gauss linear;
    
    div((viscousTerm*dev2(grad(U).T())))		Gauss linear;
    div((thermo:mu*dev(grad(U).T())))			Gauss linear;
    div((((voidfraction*rho)*nuEff)*dev2(T(grad(U)))))	Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default    	        linear;

}

snGradSchemes
{
    default 	  corrected;

}

fluxRequired
{
    default         no;
    p               ;
}

// kOmegaSST
wallDist
{
    method meshWave;
}


// ************************************************************************* //
