CFDEM/CFDEMcoupling/tutorials/ETFBCfdemSolverRhoPimple /JouleHeatFluidizedBed/CFD/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

options
{

    limitT
    {
        type            limitTemperature;
        active          yes;
        selectionMode   all;
        min             273;
        max             3000;
    }

}


// ************************************************************************* //
